Revit 2024 API
Units.GetModifiableSpecs Method
 Gets all specs for which the default FormatOptions can be modified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static IList<ForgeTypeId> GetModifiableSpecs()
Visual Basic
Public Shared Function GetModifiableSpecs As IList(Of ForgeTypeId)
Visual C++
public:
static IList<ForgeTypeId^>^ GetModifiableSpecs()
Return Value
 Identifiers of the specs for which the FormatOptions can be modified.
See Also
Units Class
Autodesk.Revit.DB Namespace